[
   {
	  "Id":"111-A",
      "ProductName":"House Of X/Powers Of X",
      "GraphicName":"HousePowersX",
      "Description":"Collects Powers Of X #1-6, House Of X #1-6. Face the future — and fear the future — as superstar writer Jonathan Hickman (INFINITY, NEW AVENGERS, FANTASTIC FOUR) changes everything for the X-Men! In HOUSE OF X, Charles Xavier reveals his master plan for mutantkind — one that will bring mutants out of humankind’s shadow and into the light once more! Meanwhile, POWERS OF X reveals mutantkind’s secret history, changing the way you will look at every X-Men story before and after. But as Xavier sows the seeds of the past, the X-Men’s future blossoms into trouble for all of mutantdom. Stories intertwine on an epic scale as Jonathan Hickman reshapes the X-Men’s past, present and future!",
      "CostPrice":"75.00",
      "MSRP":"80.00",
      "QtyOnHand":"7",
      "QtyOnBackOrder":"3",
      "Brand":"Marvel"
   },
   {
      "Id":"111-B"
      "ProductName":"Spider-Man: Life Story",
      "GraphicName":"spdrls",
      "Description":"Spider-Man makes history! In 1962's AMAZING FANTASY #15, 15-year-old Peter Parker was bitten by a radioactive spider and became the Amazing Spider-Man! Fifty-seven years have passed in the real world since that event - so what would have happened if the same amount of time passed for Peter? To celebrate Marvel's 80th anniversary, Chip Zdarsky and Spider-Man legend Mark Bagley unite to spin a unique Spidey tale - telling an entire history of Spider-Man from beginning to end, set against the key events of the decades through which he lived! From the Vietnam War to Secret Wars and Civil War, all the way through to what just might be a 72-year-old Spider-Man's final mission, prepare to watch Peter Parker age through 57 years of groundbreaking history - and find out what happens to him and those he loves the most!",
      "CostPrice":"32.66",
      "MSRP":"43.99",
      "QtyOnHand":"4",
      "QtyOnBackOrder":"8",
      "Brand":"Marvel"
   },
   {
	  "Id":"111-C",
      "ProductName":"Daredevil by Chip Zdarsky Vol. 1: Know Fea",
      "GraphicName":"drdvl",
      "Description":"The next chapter in the ever-surprising saga of Daredevil! After a brush with death, Matt Murdock must piece together his shattered life — and that includes returning to action as Daredevil! But years of trauma have taken their toll, and becoming the guardian of Hell's Kitchen he once was won't be easy. Mistakes will be made along the way — and this time, one might actually prove to be the end of him. Because when a criminal dies, and Daredevil takes the blame, Matt must go on the run in a desperate bid to clear his name! But even he can't outrun judgment forever. And with DD's absence from Hell's Kitchen, the real devils can come out to play.",
      "CostPrice":"20.78",
      "MSRP":"25.99",
      "QtyOnHand":"11",
      "QtyOnBackOrder":"1",
      "Brand":"Marvel"
   },
   {
      "Id":"111-D",
      "ProductName":"Silver Surfer: Black",
      "GraphicName":"",
      "Description":"Is this the end of Norrin Radd? In GUARDIANS OF THE GALAXY, the cosmos’ greatest defenders were thrown through a black hole — including the Silver Surfer! But his story doesn’t end there! To beat back oblivion and avoid losing himself to the darkness, the Sentinel of the Spaceways must call on all his inner light to save his own soul! With his Power Cosmic fading and the all-consuming darkness descending, will help come in the form of an unexpected ally? When the Surfer discovers something with the potential power to turn the tide, is he prepared to pay the terrible price for awakening it? And how does the Surfer’s predicament tie in to the sinister world of symbiotes? Donny Cates and Tradd Moore take the Surfer on a journey that will change him forever!",
      "CostPrice":"20.99",
      "MSRP":"22.99",
      "QtyOnHand":"0",
      "QtyOnBackOrder":"10",
      "Brand":"Marvel"
   },
   {
      "Id":"111-E",
      "ProductName":"Immortal Hulk Vol. 1",
      "GraphicName":"HULK",
      "Description":"Is he man or monster...or is he both? You know Bruce Banner. He's quiet, calm, never complains. He's a scientist who believes he can use the darkest elements of his personality to do good in the world. If someone were to shoot him in the head...all he'd do is die. But the horror lives deeper. And the horror refuses to die. When night falls, something other than the man gets up again. The horror is the Immortal Hulk! And though he cannot die, the Hulk is being hunted yet again. By the government, by Alpha Flight, by the mysterious Shadow Base - and by the Avengers! But Bruce has even bigger problems. Something terrible has infected him. Something with unspeakable plans for humanity. And the only one who knows about this dark infection...is the Immortal Hulk!",
      "CostPrice":"45.00",
      "MSRP":"50.00",
      "QtyOnHand":"2",
      "QtyOnBackOrder":"1",
      "Brand":"Marvel"
   },
   {
      "Id":"222-A",
      "ProductName":"Kingdom Come: (New Edition)",
      "GraphicName":"kingdomcome2020",
      "Description":"The unforgettable, best-selling miniseries by acclaimed writer Mark Waid and superstar painter Alex Ross returns, with a sketchbook section, annotations on the series, rare art and more! Set just after the dawn of the 21st Century in a world spinning inexorably out of control comes this grim tale of youth versus experience, tradition versus change and what defines a hero. KINGDOM COME is a riveting story pitting the old guard--Superman, Batman, Wonder Woman and their peers--against a new uncompromising generation and ultimately in the final war against each other to determine nothing less than the future of the planet. Collects Kingdom Come #1-4",
      "CostPrice":"31.34",
      "MSRP":"42.99",
      "QtyOnHand":"6",
      "QtyOnBackOrder":"2",
      "Brand":"DC Comics"
   },
   {
   "Id":"222-B",
      "ProductName":"Batman: The Long Halloween",
      "GraphicName":"longcandy",
      "Description":"Taking place during Batman's early days of crime-fighting, this new edition of the classic mystery tells the story of a mysterious killer who murders his prey only on holidays. Working with District Attorney Harvey Dent and Lieutenant James Gordon, Batman races against the clock as he tries to discover who Holiday is before he claims his next victim each month. A mystery that has the reader continually guessing the identity of the killer, this story also ties into the events that transform Harvey Dent into Batman's deadly enemy, Two-Face. Collects BATMAN: THE LONG HALLOWEEN #1-13.",
      "CostPrice":"38.51",
      "MSRP":"42.99",
      "QtyOnHand":"1",
      "QtyOnBackOrder":"15",
      "Brand":"DC Comics"
   },
   {"Id":"222-D,
      "ProductName":"Infinite Crisis Omnibus (New Edition)",
      "GraphicName":"InfcrisOMNI",
      "Description":"This omnibus collects Action Comics #826, #829, Adventures of Superman #639, #642, Countdown to Infinite Crisis, Day of Vengeance #1-6, Day of Vengeance Infinite Crisis Special, JLA #115-119, Infinite Crisis #1-6, Infinite Crisis Secret Files 2006, The OMAC Project #1-6, The OMAC Project Infinite Crisis Special, Rann-Thanagar War #1-6, The Rann-Thanagar Infinite Crisis Special, Superman #216, #219, Villains United #1-6, Villains United Infinite Crisis Special and Wonder Woman #219.",
      "CostPrice":"195.00",
      "MSRP":"200.00",
      "QtyOnHand":"1",
      "QtyOnBackOrder":"0",
      "Brand":"DC Comics"
   },
   {
   "Id":"222-E",
      "ProductName":"JLA by Grant Morrison Omnibus",
      "GraphicName":"jlamorrison",
      "Description":"In 1996, Grant Morrison--the visionary writer of The Invisible, Animal Man, Doom Patrol and more--joined forces with artist Howard Porter to relaunch the Justice League of America as JLA. Morrison and Porter revitalized the franchise by gathering DC's greatest heroes--Superman, Batman, Wonder Woman, Green Lantern, the Flash, Aquaman, and Martian Manhunter--and propelling these icons into inventive, modern stories with the highest of stakes. Now based on a Watchtower on the moon, the JLA took on classic threats including the White Martians, the Injustice Gang, and the Key; along with new foes such as Prometheus.",
      "CostPrice":"193.05",
      "MSRP":"200.00",
      "QtyOnHand":"1",
      "QtyOnBackOrder":"0",
      "Brand":"DC Comics"
   },
   {
   "Id":"222-C",
      "ProductName":"Batman: Last Knight on Earth (2019)",
      "GraphicName":"lastnknight",
      "Description":"Twenty years in the future, Bruce Wayne wakes up in Arkham Asylum. Young. Sane. And... he's never been Batman. So begins this sprawling tale of the Dark Knight as he embarks on a quest through a devastated DC landscape, featuring a massive cast of familiar faces from the DC Universe. As he tries to piece together the mystery of his past, he must unravel the cause of this terrible future and track down the unspeakable force that destroyed the world as he knew it... From the powerhouse creative team of writer Scott Snyder and artist Greg Capullo, the team that reinvented Batman from the emotional depths of Batman: Court of Owls to the epic power of Dark Nights: Metal, DC presents what could be the last Batman story ever told... Collects Batman: Last Knight on Earth #1-3.",
      "CostPrice":"39.59",
      "MSRP":"45.00",
      "QtyOnHand":"5",
      "QtyOnBackOrder":"3",
      "Brand":"DC Comics"
   },
   {
   "Id":"333-A",
      "ProductName":"The Walking Dead Compendium Vol. 1",
      "GraphicName":"wd1",
      "Description":"Since 2003, Robert Kirkman's The Walking Dead has been redefining the survival horror genre with its unique and vivid account of life after the end of the world. Although the cast is diverse and often changing (including, of course, a great number of zombies), at the heart of every tale is Rick Grimes: former police officer, husband, father, and de facto leader of a ragtag band of survivors looking to make a future for themselves in a world that no longer has one. To call The Walking Dead a zombie tale is accurate to a point, but it touches on only one facet of a story that asks timeless questions about what it means to live. It also asks whether or not this is possible in a world full of the dead. This is a great opportunity to experience this gripping read for the first time or catch up on the tale with the first four years worth of material, collected in one volume for the first time.",
      "CostPrice":"44.98",
      "MSRP":"75.00",
      "QtyOnHand":"1",
      "QtyOnBackOrder":"2",
      "Brand":"Image Comics"
   },
   {
   "Id":"333-B",
      "ProductName":"The Walking Dead Compendium Vol. 2",
      "GraphicName":"wd2",
      "Description":"Returning with the second eight volumes of the fan-favorite, New York Times bestseller series, The Walking Dead, collected into one massive collection!",
      "CostPrice":"74.41",
      "MSRP":"75.00",
      "QtyOnHand":"1",
      "QtyOnBackOrder":"1",
      "Brand":"Image Comics"
   },
   {
   "Id":"333-C",
      "ProductName":"The Walking Dead Compendium Vol. 3",
      "GraphicName":"wd3",
      "Description":"The fan- favorite, New York Times bestselling series returns with its third massive collection! With over 1,000 pages, this volume contains the next chapter of ROBERT KIRKMAN's Eisner Award-winning continuing story of survival horror. Rick Grimes's dream of rebuilding civilization is tested as the people of Alexandria come into contact with other communities that have developed their own methods of survival.",
      "CostPrice":"78.71",
      "MSRP":"80.00",
      "QtyOnHand":"1",
      "QtyOnBackOrder":"3",
      "Brand":"Image Comics"
   },
   {
   "Id":"333-D",
      "ProductName":"The Walking Dead Compendium Vol. 4",
      "GraphicName":"wd4",
      "Description":"Just in time for the new season of The Walking Dead on AMC, the fan-favorite, New York Times bestselling series returns with its FOURTH massive paperback collection! With over 1,000 pages, this volume contains the next chapter of ROBERT KIRKMAN and CHARLIE ADLARD's Eisner Award-winning continuing story of survival horror. From the Whisperers to the Commonwealth, Rick Grimes meets new allies and enemies on the way to reclaiming the world from the dead. Wars are started, and dear friends fall... Collects THE WALKING DEAD #145-193",
      "CostPrice":"76.18",
      "MSRP":"80.00",
      "QtyOnHand":"0",
      "QtyOnBackOrder":"6",
      "Brand":"Image Comics"
   },
   {
   "Id":"333-E",
      "ProductName":"Saga: Compendium One",
      "GraphicName":"saga1",
      "Description":"THE ULTIMATE BINGE-READ! Collecting the first nine volumes of the critically acclaimed, New York Times bestselling series into one massive paperback, this compendium tells the entire story (so far!) of a girl named Hazel and her star-crossed parents. Features 1,400 pages of gorgeously graphic full-color artwork, including a new cover from Eisner Award-winning SAGA co-creator FIONA STAPLES. Collects SAGA #1-54",
      "CostPrice":"79.50",
      "MSRP":"80.00",
      "QtyOnHand":"3",
      "QtyOnBackOrder":"2",
      "Brand":"Image Comics"
   }
]

